app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 1]]
SELECT "lessons".* FROM "lessons"
---
  def index
    if params[:user_id]
      @lessons = Lesson.where(user_id: params[:user_id])
      render json: @lessons, include: :exercises
    else
    @lessons = Lesson.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lessons" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "buster"], ["description", "pants and legs"], ["user_id", 1], ["created_at", "2019-04-09 19:50:45.663266"], ["updated_at", "2019-04-09 19:50:45.663266"]]
---
  def create
    @user = User.find(params[:user_id])
    @lesson = Lesson.new(lesson_params)

    if @lesson.save

UPDATE "lessons" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "lessons"."id" = $4  [["title", "Doughnuts it works"], ["description", "donuts"], ["updated_at", "2019-04-10 22:20:01.080629"], ["id", 2]]
---
  def update
    if @lesson.update(lesson_params)

DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 1]]
---
  def destroy
    @lesson.destroy

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_lesson
      @lesson = Lesson.find(params[:id])